Revit 2024 API
EnergyDataSettings Class
 This element contains settings for gbXML Export and Heating and Cooling Load Calculations and project level settings for Conceptual Energy Analysis. for serialization
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class EnergyDataSettings : Element
Visual Basic
Public Class EnergyDataSettings _
	Inherits Element
Visual C++
public ref class EnergyDataSettings : public Element
Examples
CopyC#
public void GetInfo_EnergyData(Document document)
{
   EnergyDataSettings energyData = EnergyDataSettings.GetFromDocument(document);
   if (null != energyData)
    {
        string message = "energyData : ";
        message += "\nBuildingType : " + energyData.BuildingType;
        TaskDialog.Show("Revit",message);
    }
}
CopyVB.NET
Public Sub GetInfo_EnergyData(document As Document)
    Dim energyData As EnergyDataSettings = EnergyDataSettings.GetFromDocument(document)
    If energyData IsNot Nothing Then
        Dim message As String = "energyData : "
        message += vbLf & "BuildingType : " + energyData.BuildingType
        TaskDialog.Show("Revit", message)
    End If
End Sub
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyDataSettings
See Also
EnergyDataSettings Members
Autodesk.Revit.DB.Analysis Namespace